# Capitulo 2 - Resumo de dados

In [2]:
import pandas as pd

'[var]' is not recognized as an internal or external command,
operable program or batch file.

In [4]:
#importando table e visualizando colunas
tab21 = pd.read_excel('tab_21.xlsx')
tab21.columns.values

array(['N', 'Estado Civil', 'Grau de Instrução', 'N de Filhos',
       'Salario (x Sal Min)', 'Anos', 'Meses', 'Região de Procedência'],
      dtype=object)

In [5]:
tab21.head()

,N,Estado Civil,Grau de Instrução,N de Filhos,Salario (x Sal Min),Anos,Meses,Região de Procedência
0,1,solteiro,ensino fundamental,NaN,4.00,26,3,interior
1,2,casado,ensino fundamental,1.0,4.56,32,10,capital
2,3,casado,ensino fundamental,2.0,5.25,36,5,capital
3,4,solteiro,ensino médio,NaN,5.73,20,10,outra
4,5,solteiro,ensino fundamental,NaN,6.26,40,7,outra

In [6]:
tab21.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   N                      36 non-null     int64
 1   Estado Civil           36 non-null     object
 2   Grau de Instrução      36 non-null     object
 3   N de Filhos            20 non-null     float64
 4   Salario (x Sal Min)    36 non-null     float64
 5   Anos                   36 non-null     int64
 6   Meses                  36 non-null     int64
 7   Região de Procedência  36 non-null     object
dtypes: float64(2), int64(3), object(3)
memory usage: 2.4+ KB